<a href="https://colab.research.google.com/github/kishorekishu4/07-01-2025/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

data = {
    "Name": ["John", "Alice", "Bob", "Diana"],
    "Age": [28, 34, 23, 29],
    "Department": ["HR", "IT", "Marketing", "Finance"],
    "Salary": [45000, 60000, 35000, 50000]
}
Marks = {
    "Name":["vedith","Rohith"],
    "AI":[12,15],
    "ML":[15,14]
}



df = pd.DataFrame(data)
df1=pd.DataFrame(Marks)

print(df)
print(df1)

    Name  Age Department  Salary
0   John   28         HR   45000
1  Alice   34         IT   60000
2    Bob   23  Marketing   35000
3  Diana   29    Finance   50000
     Name  AI  ML
0  vedith  12  15
1  Rohith  15  14

In [ ]:
import numpy as np
arr  = np.array([[[1,2,3],[4,5,6]],[[7,8,9],[10,11,12]]])
print(arr)
print(arr[1,1,2])

[[[ 1  2  3]
  [ 4  5  6]]

 [[ 7  8  9]
  [10 11 12]]]
12